#!/bin/bash
#========================================================================================================================
# https://github.com/ophub/amlogic-s9xxx-openwrt
#描述:自动构建开放/
#功能:diy脚本(更新后修改默认IP、主机名、主题、添加/删除软件包等)。)
#源代码存储库:httPS://gihub.com/AdobeWLT/分支:主要
#========================================================================================================================

# ------------------------------- Main source started -------------------------------
#
#添加"根"用户的默认密码(将空密码更改为"密码")
 种子 - 我    's/root:::0:99999:7:::/root:$1$V4UetPzk$CYXluq4wUazHjmCDBCqXF.::0:99999:7:::/g' 包裹/基库文件/档案/文件/等/阴影

#套等/开放式释放
 种子 - 我   "s|DISTRIB_REVISION='.*'|DISTRIB_REVISION='R $(date +%Y.%m.%d) '|g" 包/基文件/档案/文件/等等/公开释放
 回声 "DISTRIB_SOURCECODE='official'" 包装/基础文件/档案/文件/等/开放式释放

#修改默认IP ( 从192.168.1.1修改为10.10.10.1 )
# sed -i 's/192.168.1.1/10.10.10.1/g' package/base-files/files/bin/config_generate
#
# ------------------------------- Main source ends -------------------------------

# ------------------------------- Other started -------------------------------
#
#加入透明-应用-逻辑
//吉图布.com/O多布/路基-辅助/后备箱/路基-辅助/路基-辅助/路基-辅助/路基-辅助

#冷雪狼默认软件包替换为利诺相关软件包
# rm -rf feeds/packages/utils/{containerd,libnetwork,runc,tini}
#svncohttps://github.com/lienol/开放式包装袋/后备箱/针脚/{集装箱、伦敦图书馆、跑步场、泰尼饲料/包装/针脚

#添加第三方软件包(整个存储库)
#git克隆https://githb.com/利布莱梅/石灰包装。
#添加第三方软件包(指定包)
#所罗门群岛国家集团*********************************
#添加到编译选项(根据第三方软件包的需求添加相关的依赖项)
#SED-I"/DIDUUULT_包/S/美元/海盗-苹果-苹果-苹果-IP-NatIP共享----国家----海盗---HttPC-模块-Lua/"目标/LINU/ARMVT/制作文件

#申请补丁
# git apply ../config/patches/{0001*,0002*}.patch --directory=feeds/luci
#
# ------------------------------- Other ends -------------------------------
